app/Controllers/Auth.php

    public function login_check()
    {
        $session = session();
        $email = $this->request->getPost('u_name');
        $password = $this->request->getPost('password');

            // Dummy check for example purposes
        if (empty($email) || empty($password)) {
            return redirect()->to('/login')->with('error', 'Email and password are required');
        } else {
            $user = $this->userModel
                         ->where('user_emails', $email)
                         ->join('user_in_role', 'user_in_role.role_user_idd = user_login_details.login_user_idd', 'left')
                         ->join('role_details', 'role_details.role_detail_idd = user_in_role.role_role_idd', 'left')
                         ->first();
            if ($user && password_verify($password, $user['user_password'])) {

                $this->db_login_info->insert([
                    'logged_user_id'    => $user['login_user_idd'],
                    'logged_time'       => time(),
                    'logged_dates'      => date('Y-m-d'),
                    'logged_agent_info' => json_encode([
                        'ip' => $this->request->getIPAddress(),
                        'userAgent' => $this->request->getUserAgent()->getAgentString()
                    ])
                ]);
---
INSERT INTO `login_info` (`logged_user_id`, `logged_time`, `logged_dates`, `logged_agent_info`) VALUES ('12', 1763217035, '2025-11-15', '{\"ip\":\"::1\",\"userAgent\":\"Mozilla\\/5.0 (Windows NT 10.0; Win64; x64; rv:145.0) Gecko\\/20100101 Firefox\\/145.0\"}')