app/Controllers/Customer.php

SELECT SUM(`added_amount`) AS `added_amount`
FROM `user_added_amounts`
WHERE `user_info_id_addeds` = '12'
SELECT SUM(`cutting_amounts`) AS `cutting_amounts`
FROM `user_cutted_amnt`
WHERE `user_cut_user_idd` = '12'
---
    public function get_my_wallet_amount()
    {
        $userInfoId = $this->session->get('userInfoId');
        $user_added_wallet = $this->db->table('user_added_amounts')
                                    ->selectSum('added_amount')
                                    ->where('user_info_id_addeds', $userInfoId)
                                    ->get()
                                    ->getRow()
                                    ->added_amount;
        $user_used_wallet = $this->db->table('user_cutted_amnt')
                                    ->selectSum('cutting_amounts')
                                    ->where('user_cut_user_idd', $userInfoId)
                                    ->get()
                                    ->getRow()
                                    ->cutting_amounts;