app/Controllers/Home.php

SELECT *
FROM `category`
SELECT *
FROM `product_buying_info`
LEFT JOIN `product_information` ON `product_buying_info`.`product_buy_product_idd` = `product_information`.`id`
LEFT JOIN `category` ON `product_information`.`category_id` = `category`.`cat_id`
LEFT JOIN `sub_category` ON `product_information`.`product_subcat_id` = `sub_category`.`sub_cat_idd`
---
    public function index()
    {
        $data['cats'] = $this->db->table('category')->get()->getResult();
        $data['products'] = $this->db
                                 ->table('product_buying_info')
                                 ->join('product_information', 'product_buying_info.product_buy_product_idd = product_information.id', 'left')
                                 ->join('category', 'product_information.category_id = category.cat_id', 'left')
                                 ->join('sub_category', 'product_information.product_subcat_id = sub_category.sub_cat_idd', 'left')
                                 ->get()
                                 ->getResult();