app/Controllers/User.php

SELECT *
FROM `daily_profit_checkbox`
---
    public function dashboard()
    {
        $userId = $this->session->get('userInfoId');
        $prevToday = date('Y-m-d', strtotime('-1 day'));
        $data['daily_profit'] = $this->db->table('daily_profit_checkbox')
                                    ->get()
                                    ->getResult();