app/Libraries/Template.php

SELECT *
FROM `settings`
WHERE `vendor_idd` = 1
SELECT *
FROM `user_full_info`
WHERE `user_full_info_idd` = '12'
---
    public function front($view, $data = [])
    {
        $data['setting'] = $this->db->table('settings')
                             ->where('vendor_idd', 1)
                             ->get()
                             ->getRow();
        if ($this->session->get('isLoggedIn')) {
            $user_id = $this->session->get('userInfoId');
            $data['my_info'] = $this->db->table('user_full_info')
                                        ->where('user_full_info_idd', $user_id)
                                        ->get()
                                        ->getRow();